bpel-test/src/test/resources/bpel/2.0/TestXslTransform/HelloXslWorld.wsdl

<?xml version="1.0" encoding="utf-8" ?>

<wsdl:definitions 
    targetNamespace="http://pxe/bpel/unit-test.wsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:tns="http://pxe/bpel/unit-test.wsdl"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:types="http://pxe/bpel/types"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:bpws="http://schemas.xmlsoap.org/ws/2004/03/business-process/"
    xmlns:plnk="http://schemas.xmlsoap.org/ws/2004/03/partner-link/">

    <wsdl:types>
        <xsd:schema targetNamespace="http://pxe/bpel/types">
                <xsd:complexType name="ContentCT">
                <xsd:sequence>
                    <xsd:element name="content" type="xsd:string"/>
                </xsd:sequence>
                </xsd:complexType>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="HelloXslMessage">
        <wsdl:part name="TestPart" type="types:ContentCT"/>
    </wsdl:message>

    <wsdl:portType name="HelloXslPortType">
        <wsdl:operation name="helloXsl">
            <wsdl:input message="tns:HelloXslMessage" name="TestIn"/>
            <wsdl:output message="tns:HelloXslMessage" name="TestOut"/>
        </wsdl:operation>    
    </wsdl:portType>

    <wsdl:binding name="HelloXslSoapBinding" type="tns:HelloXslPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="helloXsl">
            <soap:operation soapAction="" style="rpc"/>
            <wsdl:input>
                <soap:body
                    namespace="http://pxe/bpel/unit-test.wsdl"
                    use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body
                    namespace="http://pxe/bpel/unit-test.wsdl" 
                    use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="HelloXslService">
                <wsdl:port name="HelloXslPort" binding="tns:HelloXslSoapBinding">
                <soap:address location="http://localhost:8080/pxe/soap/helloXslWorld"/>
                </wsdl:port>
    </wsdl:service>
    
    <plnk:partnerLinkType name="HelloXslPartnerLinkType">
        <plnk:role name="me" portType="tns:HelloXslPortType"/>
        <plnk:role name="you" portType="tns:HelloXslPortType"/>
    </plnk:partnerLinkType>
</wsdl:definitions>

